const content = `
　　“广州白云发布”5月1日消息，广州市白云区新型冠状病毒肺炎疫情防控指挥部发布关于新增人和镇、新市街、鹤龙街部分区域为封控区、管控区、防范区的通告。　　一、新增封控区8个　　（一）人和镇5个。　　1。凤和村凤元街环村路1号。　　2。老井农庄。　　3。东华村达贤街48号、50号、52号；东华村大田西七巷12号、14号，九巷12号、14号，十一巷12号。　　4。凤和凤南东路四街十二巷1号至十二巷7号、四街29号至十五巷6号、四街十二巷7号至十五巷6号、四街25号至四街29号。　　5。新联村新联东路北四巷5号、6号、7号、8号、9号、10号及新联村新联东路北三巷5号、7号、9号。　　（二）新市街道2个。　　1。棠涌村棠乐路东四巷1号、2号、3号、4号、5号、6号，棠涌村棠乐路东三巷1号、3号、5号。　　2。棠涌西约二巷40-1号、39号、38号、34-1号、34号、40号。　　（三）鹤龙街道1个。　　黄边北路150号。　　上述区域严格实行“区域封闭、足不出户、服务上门”管理措施，定期进行核酸检测。　　二、新增管控区5个　　（一）人和镇2个。　　1。凤和村凤元街1号、2号、3号，环村路2号、3号。　　2。岗尾村。　　（二）新市街道2个。　　1。东至棠涌村棠乐路东一巷，西至棠涌村棠乐路临时编号16-3，南至棠涌村棠乐路，北至棠涌村棠乐路火央基。　　2。西往南方向西苑路41-49号、西往东方向西苑东九巷，北往东方向西苑东九巷尾（胡同）到西约一巷27号，东往西方向西约一巷27号往西苑路49号、棠涌西苑中街2号107铺到棠涌西苑路18号堡狮隆临街档1109号。　　（三）鹤龙街道1个。　　黄边北路150号B1北裙楼及塔楼、152号裙楼及塔楼、B5北塔楼及裙楼。　　上述区域严格实行“足不出区、错峰取物”管理措施。　　三、新增防范区1个　　新市街道全域。　　上述区域实行“强化社会面管控、严格限制人员聚集”管理措施。区域内全体人员24小时内检测核酸一次，人员非必要不外出。　　以上措施自2022年4月30日起执行，后续将根据疫情防控形势变化及时调整。请上述管控区域的市民朋友，非必要不出门，并积极配合镇街、村居采取必要的核酸检测等疫情防控措施。        点击进入专题：新型冠状病毒肺炎疫情  责任编辑：张建利 

// `;
// console.log(content.split("　　"));
// const reg = /[\s+]/g;
// console.log(content.replace(reg," "));

const str = "fffff"
console.log(str.split('|'));